Tekla Open API Reference for Tekla Structures 2025
Events Events
The Events type exposes the following members.
Events
Name | Description
AnnotationSelectionChange
 The SelectionChange event is raised when the user changes the current selection of an annotation inside Tekla Structures.
ClashCheckDone
 The ClashCheckDone event is raised just after clash check is completed.
ClashDetected
 The ClashDetected event is raised just after the detection of each clash. The clash information is saved before the event is triggered.
ClipPlaneChanged
 Occurs when user deletes a clip plane.
CommandStatusChange
 The CommandStatusChange event is raised when a command is started/ended.
HiddenObjectsChanged
 Occurs when user hides an object or view is redrawn
Interrupted
 Occurs when user interrupts.
ModelChanged |  Obsolete.
 The ModelChanged event is raised just after some changes have been made to the model.
Note, this event is however not triggered when UNDO or REDO are performed.
ModelLoad
 The ModelLoad event is raised just after a model has been loaded.
ModelLoadInfo
 The ModelLoadInfo event is raised just after a model has been loaded with the model load information as a string parameter.
ModelObjectChanged
 The ModelObjectChanged event is raised just after some changes have been made to the model objects.
Note, this event is triggered when UNDO or REDO are performed!!
ModelObjectNumbered
 The ModelObjectNumbered event is raised when model object is numbered.
ModelSave
 The ModelSave event is raised just after a model has been saved.
ModelSaveAs
 The ModelSaveAs event is raised just after a model has been saved using save as.
ModelSaveInfo
 The ModelSave event is raised just after a model has been saved with the model save information as a string parameter.
ModelUnloading
 The ModelUnloading event is raised just before the model is unloaded.
ModelUnloadingSync
 The ModelUnloadingSync event is raised synchronously on the main thread just before the model is unloaded.
 Use this event only when core resources need be cleaned up before the model unloading proceeds. All UI-only related resource cleanup should be done in the async ModelUnloading event.
OnModelUnloadingSync(String, Object[])
Numbering
 The Numbering event is raised just after a model has been numbered.
ProjectInfoChanged
 The ProjectInfoChanged event is raised just after some changes have been made to the project info.
Note, this event is however not triggered when UNDO or REDO are performed.
SelectionChange
 The SelectionChange event is raised when the user changes the current selection inside Tekla Structures.
TeklaStructuresExit
 The TeklaStructuresExit event is raised just before Tekla Structures exits. After this event has been called the user will no longer be able to perform any calls to Tekla Structures.
TemporaryStatesChanged
 Occurs when temporary states are changed.
UndoClicked
 Occurs when user clicks undo.
ViewCameraChanged
 Occurs when view camera is changed.
ViewClosed
 Occurs when view is closed.
Top
See Also
Reference
Events Class
Tekla.Structures.Model Namespace